In [2]:
import pandas as pd
import sqlite3 as sql

In [3]:
conn = sql.connect('database.sqlite')
conn

#### **1. What is the average TotalPayBenefits for each JobTitle? exclude ('Not Provided', 'Not provided')**

In [4]:
pd.read_sql_query(
    "SELECT JobTitle, AVG(TotalPayBenefits) AS Avg_TotalPayBenefits "
    "FROM Salaries "
    "WHERE JobTitle NOT IN ('Not Provided', 'Not provided') "
    "GROUP BY JobTitle",
    conn
)

                                            JobTitle  Avg_TotalPayBenefits
0                                      ACCOUNT CLERK          44035.664337
1                                         ACCOUNTANT          47429.268000
2                                  ACCOUNTANT INTERN          29031.742917
3                        ACPO,JuvP, Juv Prob (SFERS)          80266.370000
4                                      ACUPUNCTURIST          67594.400000
...                                              ...                   ...
2153                           X-RAY LABORATORY AIDE          52705.880385
2154                           X-Ray Laboratory Aide          69521.123200
2155  YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS          53632.870000
2156                              Youth Comm Advisor          60118.550000
2157                                     ZOO CURATOR          66686.560000

[2158 rows x 2 columns]

#### **2. Show The JobTitle and Overtime Pay for All Employees With Overtime Pay greater than 50000**

In [5]:
pd.read_sql_query(
    "SELECT JobTitle, OvertimePay "
    "FROM Salaries "
    "WHERE OvertimePay > 50000",
    conn
)

                                              JobTitle   OvertimePay
0                      CAPTAIN III (POLICE DEPARTMENT)     106088.18
1                 WIRE ROPE CABLE MAINTENANCE MECHANIC      56120.71
2                   BATTALION CHIEF, (FIRE DEPARTMENT)       89062.9
3                   BATTALION CHIEF, (FIRE DEPARTMENT)      86362.68
4     ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)      71344.88
...                                                ...           ...
2163                           Parking Control Officer      54738.36
2164                                      Not provided  Not Provided
2165                                      Not provided  Not Provided
2166                                      Not provided  Not Provided
2167                                      Not provided  Not Provided

[2168 rows x 2 columns]

#### **3. What is the total number of unique employees? exclude ('Not Provided', 'Not provided')**

In [6]:
pd.read_sql_query(
    "SELECT COUNT(DISTINCT EmployeeName) AS unique_employees "
    "FROM Salaries "
    "WHERE EmployeeName NOT IN ('Not Provided', 'Not provided')",
    conn
)

   unique_employees
0            110808

#### **4.Show The Top 10 highest Paid Employees**

In [7]:
pd.read_sql_query(
    "SELECT EmployeeName, TotalPay "
    "FROM Salaries "
    "WHERE EmployeeName NOT IN ('Not Provided', 'Not provided') "
    "ORDER BY TotalPay DESC "
    "LIMIT 10",
    conn
)

           EmployeeName    TotalPay
0        NATHANIEL FORD  9999999.00
1           David Shinn   471952.64
2            Amy P Hart   390111.98
3        Gary Altenberg   362844.66
4         John Goldberg   350403.41
5           Samson  Lai   347102.32
6       Ellen G Moffatt   344187.46
7  William J Coaker Jr.   339653.70
8        Gregory P Suhr   339282.07
9     Frederick Binkley   337204.86

#### **5.Show All Employees Ordered By Their TotalPay Benefits In Descending Order**

In [8]:
pd.read_sql_query(
    "SELECT EmployeeName, TotalPayBenefits "
    "FROM Salaries "
    "WHERE EmployeeName NOT IN ('Not Provided', 'Not provided') "
    "ORDER BY TotalPayBenefits DESC",
    conn
)

                EmployeeName  TotalPayBenefits
0             NATHANIEL FORD         567595.43
1                David Shinn         510732.68
2                 Amy P Hart         479652.21
3       William J Coaker Jr.         436224.36
4             Gregory P Suhr         425815.28
...                      ...               ...
148642         Roy I Tillery              0.00
148643      Timothy E Gibson             -2.73
148644        Mark E Laherty             -8.20
148645         David P Kucia            -33.89
148646             Joe Lopez           -618.13

[148647 rows x 2 columns]